{
  "backend/main.mo": "Minimal Motoko actor definition with an empty actor body, serving as the backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of the ocean waves video hero with a Three.js/React Three Fiber animated forest scene, referencing ForestScene.tsx and Home.tsx as the affected files.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose, key changes, and implementation details for the GreenLeaf plant shop application.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the GreenLeaf Vite/React app, mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all page routes, wraps the app in Cart, Wishlist, and Theme providers, and gates the LoadingLandingPage to the first session visit using sessionStorage.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component with sage green styling that displays cart items with quantity controls, remove buttons, and a checkout link.",
  "frontend/src/components/Footer.tsx": "Site footer with navigation links, social media icons (Instagram, Facebook, X), copyright info, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/ForestScene.tsx": "A Three.js/React Three Fiber 3D scene featuring animated dust particles, golden light orbs, and swaying tree silhouettes to create an atmospheric forest background.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a Navbar, Footer, and CartDrawer, managing cart open/close state.",
  "frontend/src/components/LoadingLandingPage.tsx": "Animated loading screen using a Canvas API-drawn geometric particle system with a sage/beige palette, displaying a logo and progress bar before calling onComplete.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple spinning circle loading indicator styled with sage-colored Tailwind CSS border classes.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with scroll-aware styling, cart icon with item count badge, and a responsive mobile hamburger menu.",
  "frontend/src/components/PageTransition.tsx": "Thin wrapper component that applies a fade-in and slide-up entrance animation to its children on mount.",
  "frontend/src/components/ProductCard.tsx": "Product card displaying image, name, description, price, and rating with hover-reveal add-to-cart and wishlist buttons.",
  "frontend/src/components/WishlistButton.tsx": "Heart icon button that toggles a product's wishlist state via WishlistContext, with filled/unfilled visual feedback.",
  "frontend/src/context/CartContext.tsx": "React context providing cart state (add, remove, update quantity, clear) with localStorage persistence and cross-tab sync via storage events.",
  "frontend/src/context/WishlistContext.tsx": "React context managing a wishlist of product IDs with localStorage persistence and toggle/check helpers.",
  "frontend/src/data/careGuides.ts": "Static array of four CareGuide objects covering beginner and care-tip topics, each with metadata and a plant image path.",
  "frontend/src/data/categories.ts": "Static array of four plant Category objects (Succulents, Tropical, Low-Light, Pet-Friendly) with names, descriptions, and image paths.",
  "frontend/src/data/products.ts": "Defines and exports a static array of plant Product objects with details like name, price, images, care requirements, and ratings for the shop.",
  "frontend/src/data/testimonials.ts": "Exports a static array of three customer Testimonial objects with name, quote, and rating fields.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and returns an ICP backend actor using the current Internet Identity, refreshing dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state.",
  "frontend/src/hooks/useMediaQuery.ts": "Custom hook that reactively tracks a CSS media query match, with a convenience useIsMobile hook for the 768px breakpoint.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that returns a scroll-based offset value scaled by a speed factor, using requestAnimationFrame for smooth parallax effects.",
  "frontend/src/hooks/useScroll.ts": "Custom hook that tracks the current scroll position and direction, and whether the page has scrolled past 50px.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to return a boolean indicating whether a referenced element has entered the viewport.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines sage-green and beige CSS custom property palettes for light and dark modes, and adds utility classes for glassmorphism, soft shadows, and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CareGuide.tsx": "Page component that renders a list of plant care guide articles with a scroll-driven reading progress bar at the top.",
  "frontend/src/pages/Checkout.tsx": "Multi-step checkout page (contact, shipping, payment) that reads cart items from context, calculates totals with tax and shipping, and shows an empty-cart fallback with a link back to the shop.",
  "frontend/src/pages/Home.tsx": "Homepage featuring a Three.js ForestScene hero background, scroll-animated sections for benefits, care tips, categories, best-sellers, testimonials, and a newsletter signup form.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that displays a single product's image, care indicators, rating, and related products, with add-to-cart and wishlist functionality.",
  "frontend/src/pages/Shop.tsx": "Shop listing page with filterable product grid supporting category, price range, water level, and sunlight filters, with a responsive mobile drawer for filters.",
  "frontend/src/types/product.ts": "TypeScript interfaces defining the data shapes for Product, CartItem, Category, Testimonial, and CareGuide used throughout the app.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom sage and beige color palettes, soft box shadows, float animations, and Inter as the default font.",
  "project_state.json": "Project state metadata for GreenLeaf Shop tracking the current feature work to replace the homepage ocean waves video with an animated Three.js forest scene, along with existing features and pending requests."
}