{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting that the LoadingLandingPage canvas leaf particles were updated to use a transparent background instead of white, with high confidence and a reference to the affected file.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary of all frontend source files, describing the purpose and key details of each component, page, hook, and data file in the project.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for light and dark theme design tokens (colors, radius, chart colors, sidebar).",
  "frontend/index.html": "HTML entry point for the GreenLeaf app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the app in Cart, Wishlist, and Theme providers, and gates the LoadingLandingPage to the first session visit using sessionStorage.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component with sage green styling that displays cart items with quantity controls, subtotal, and a checkout link.",
  "frontend/src/components/Footer.tsx": "Site footer with navigation links, social media icons, copyright notice, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper that composes the Navbar, page content via Outlet, Footer, and CartDrawer with cart open/close state.",
  "frontend/src/components/LoadingLandingPage.tsx": "Animated loading/landing page component that renders floating leaf particles on a canvas using masked offscreen canvases to remove white backgrounds, with phased logo/tagline reveal and a progress bar before calling onComplete.",
  "frontend/src/components/LoadingSpinner.tsx": "Renders a centered animated spinning circle using Tailwind CSS classes as a loading indicator.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with scroll-aware styling, cart icon with item count badge, desktop nav links, and a mobile hamburger menu.",
  "frontend/src/components/PageTransition.tsx": "Wraps children in a div with a fade-in and slide-up entrance animation for page transitions.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, description, price, rating, wishlist button, and an animated add-to-cart button that links to the product detail page.",
  "frontend/src/components/WishlistButton.tsx": "Heart icon button that toggles a product's wishlist state using WishlistContext, with filled/unfilled visual feedback.",
  "frontend/src/context/CartContext.tsx": "Provides cart state (items, counts, subtotal) with add/remove/update/clear operations, persisted to localStorage and synced across tabs via storage events.",
  "frontend/src/context/WishlistContext.tsx": "Provides wishlist state as an array of product ID strings with toggle and check operations, persisted to localStorage.",
  "frontend/src/data/careGuides.ts": "Static array of four CareGuide objects covering beginner and care-tip topics with titles, excerpts, categories, reading times, and images.",
  "frontend/src/data/categories.ts": "Static array of four Category objects (Succulents, Tropical, Low-Light, Pet-Friendly) with names, descriptions, and images.",
  "frontend/src/data/products.ts": "Static array of Product objects representing the plant catalog, each with pricing, care attributes, images, ratings, and stock status.",
  "frontend/src/data/testimonials.ts": "Static array of three customer Testimonial objects with name, quote, and 5-star ratings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity for authenticated or anonymous access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useMediaQuery.ts": "Custom hook that tracks whether a CSS media query matches, with a convenience `useIsMobile` hook for screens up to 768px wide.",
  "frontend/src/hooks/useParallax.ts": "Custom hook that returns a scroll-based offset value scaled by a configurable speed, using requestAnimationFrame for smooth parallax effects.",
  "frontend/src/hooks/useScroll.ts": "Custom hook that tracks the current scroll position and direction, exposing `scrollY`, `scrollDirection`, and an `isScrolled` boolean.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to return a boolean indicating whether a referenced element has entered the viewport.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind base/components/utilities, a sage-green and beige CSS custom property palette for light and dark modes, and utility classes for glassmorphism, soft shadows, and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with TanStack Query and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/CareGuide.tsx": "Page component that displays a list of plant care guide articles with a reading progress bar that updates on scroll.",
  "frontend/src/pages/Checkout.tsx": "Multi-step checkout page with contact, shipping, and payment form steps, displaying an order summary with subtotal, shipping, and tax calculations.",
  "frontend/src/pages/Home.tsx": "Home page featuring a full-screen video hero, scroll-animated sections for care tips, plant benefits, categories, best-selling products, and testimonials, with a newsletter signup form.",
  "frontend/src/pages/ProductDetail.tsx": "Renders a detailed view for a single product identified by URL param, showing image, care info, rating, price, and related products, with add-to-cart and wishlist functionality.",
  "frontend/src/pages/Shop.tsx": "Shop page that displays all products in a filterable grid, supporting filters for category, water level, sunlight, and price range with a responsive mobile drawer.",
  "frontend/src/types/product.ts": "Defines TypeScript interfaces for core data models: Product, CartItem, Category, Testimonial, and CareGuide.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom sage/beige color palettes, soft shadows, float animations, and CSS variable-based semantic color tokens.",
  "project_state.json": "Tracks project state at version 3, recording an existing fix request to remove the white background from floating leaf canvas particles on the LoadingLandingPage component."
}