{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting four completed features that apply sage green backgrounds to Shop, ProductDetail, CareGuide, and Checkout pages while maintaining existing functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, contexts, and data files with implementation details (content appears truncated).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes, borders, and sidebar styling using oklch color space.",
  "frontend/index.html": "HTML entry point for the GreenLeaf React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with five routes (Home, Shop, ProductDetail, CareGuide, Checkout) and wrapping with ThemeProvider, CartProvider, and WishlistProvider.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component from the right with item management (quantity controls, remove), empty state, subtotal display, and animated transitions (content appears truncated).",
  "frontend/src/components/Footer.tsx": "Footer component with four-column grid layout containing brand info, shop links, support links, social media icons, and attribution to caffeine.ai with UTM tracking (content appears truncated).",
  "frontend/src/components/Layout.tsx": "Main layout wrapper managing Navbar, page outlet, Footer, and CartDrawer with state for cart visibility.",
  "frontend/src/components/LoadingSpinner.tsx": "Loading spinner component with rotating sage-colored border animation using absolute positioning and Tailwind classes.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with responsive mobile menu, cart button with item count badge, and scroll-based styling transitions. Includes links to Home, Shop, and Care Guide pages.",
  "frontend/src/components/PageTransition.tsx": "Simple wrapper component that applies fade-in and slide-up animation to page content during route transitions.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, details, rating, and price with hover effects. Includes add-to-cart button and wishlist toggle functionality.",
  "frontend/src/components/WishlistButton.tsx": "Heart-shaped button component that toggles products in/out of the wishlist with visual feedback and animation.",
  "frontend/src/context/CartContext.tsx": "React context providing cart state management with localStorage persistence, including add/remove/update operations and computed totals. Syncs cart across browser tabs via storage events.",
  "frontend/src/context/WishlistContext.tsx": "React context managing wishlist state with localStorage persistence, providing toggle and check functions for product IDs.",
  "frontend/src/data/careGuides.ts": "Static data array containing four care guide articles with titles, excerpts, categories, reading times, and images for plant care education.",
  "frontend/src/data/categories.ts": "Static data array defining four plant categories (Succulents, Tropical, Low-Light, Pet-Friendly) with descriptions and images.",
  "frontend/src/data/products.ts": "Static product catalog containing detailed plant information including names, prices, care requirements, difficulty levels, and images for 8+ plant products.",
  "frontend/src/data/testimonials.ts": "Static array of three customer testimonials with names, quotes, and 5-star ratings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor with authentication support, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMediaQuery.ts": "Custom React hooks for responsive design: useMediaQuery tracks CSS media query matches, and useIsMobile detects mobile viewports (max-width: 768px).",
  "frontend/src/hooks/useParallax.ts": "React hook that calculates parallax scroll offset based on a configurable speed multiplier, using requestAnimationFrame for smooth performance.",
  "frontend/src/hooks/useScroll.ts": "React hook that tracks scroll position (scrollY), scroll direction (up/down), and whether the page has scrolled past 50px threshold.",
  "frontend/src/hooks/useScrollAnimation.ts": "React hook using IntersectionObserver to detect when an element becomes visible in the viewport, useful for triggering scroll-based animations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom sage green and beige color palettes using OKLCH, dark mode support, glassmorphism utilities, and animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/CareGuide.tsx": "Displays plant care guide articles with reading progress bar, categorized content cards showing images, excerpts, and estimated reading times.",
  "frontend/src/pages/Checkout.tsx": "Multi-step checkout page with form validation, order summary, shipping/tax calculations, and cart integration for completing plant purchases.",
  "frontend/src/pages/Home.tsx": "Landing page featuring video hero section, featured products, plant categories, care tips, benefits sections, testimonials, and newsletter signup with parallax effects.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page component that displays individual product information including images, pricing, care indicators, and related products, with add-to-cart and wishlist functionality.",
  "frontend/src/pages/Shop.tsx": "Shop page component with filterable product grid supporting category, price range, water level, and sunlight filters, with responsive mobile/desktop filter layouts.",
  "frontend/src/types/product.ts": "TypeScript type definitions for Product, CartItem, Category, Testimonial, and CareGuide interfaces used throughout the application.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom sage and beige color palettes, animations (float, accordion), shadows, and extended theme settings.",
  "project_state.json": "Project state tracking document showing completed sage green background features for Shop, Product Detail, Care Guide, and Checkout pages, with pending request to keep Home page unchanged."
}