{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting six implemented features (hero section, categories, carousel, benefits, testimonials, newsletter) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, contexts, and data files for the GreenLeaf plant e-commerce application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using oklch color space.",
  "frontend/index.html": "HTML entry point for the GreenLeaf application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with five routes (Home, Shop, ProductDetail, CareGuide, Checkout) and wrapping with ThemeProvider, CartProvider, and WishlistProvider.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component from the right side with item management (quantity controls, remove), empty state, subtotal display, and animated transitions.",
  "frontend/src/components/Footer.tsx": "Footer component with four-column grid layout containing site links, social media icons, and attribution to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper containing Navbar, page content outlet, Footer, and CartDrawer with state management for cart visibility.",
  "frontend/src/components/LoadingSpinner.tsx": "Loading spinner component with rotating circular border animation styled with sage green colors.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with responsive mobile menu, cart button with item count badge, scroll-based styling, and navigation links to Home, Shop, and Care Guide pages.",
  "frontend/src/components/PageTransition.tsx": "Simple wrapper component that applies fade-in and slide-in animations to page content during transitions.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, price, rating, and wishlist button with hover effects and add-to-cart functionality.",
  "frontend/src/components/WishlistButton.tsx": "Heart-shaped button component that toggles product wishlist status with visual feedback and animation.",
  "frontend/src/context/CartContext.tsx": "React context providing shopping cart state management with localStorage persistence, including add/remove/update operations and computed totals.",
  "frontend/src/context/WishlistContext.tsx": "React context managing wishlist state with localStorage persistence, providing toggle and check functions for product IDs.",
  "frontend/src/data/careGuides.ts": "Static data array containing plant care guide articles with titles, excerpts, categories, reading times, and placeholder images.",
  "frontend/src/data/categories.ts": "Static data array defining plant categories (Succulents, Tropical, Low-Light, Pet-Friendly) with descriptions and images.",
  "frontend/src/data/products.ts": "Static product catalog data containing detailed plant information including names, prices, care requirements, difficulty levels, and stock status.",
  "frontend/src/data/testimonials.ts": "Static array of customer testimonials with names, quotes, and 5-star ratings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMediaQuery.ts": "Custom React hooks for responsive design: useMediaQuery tracks CSS media query matches, and useIsMobile detects mobile viewports (≤768px).",
  "frontend/src/hooks/useScroll.ts": "React hook that tracks scroll position (scrollY), scroll direction (up/down), and whether the page has scrolled past 50px.",
  "frontend/src/hooks/useScrollAnimation.ts": "React hook using IntersectionObserver to detect when a referenced element becomes visible in the viewport, useful for triggering scroll-based animations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for sage/beige color palette, light/dark mode support, glassmorphism utilities, custom animations (float, gradientShift), and accessibility features including reduced motion support.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for data fetching and authentication.",
  "frontend/src/pages/CareGuide.tsx": "Displays a list of plant care guide articles with reading progress bar, category tags, reading time estimates, and staggered fade-in animations.",
  "frontend/src/pages/Checkout.tsx": "Multi-step checkout page with form validation, order summary, shipping/tax calculations, and empty cart handling with navigation back to shop.",
  "frontend/src/pages/Home.tsx": "Landing page featuring hero section with animated background, featured product grid, category navigation, testimonials, and newsletter signup form.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page component that displays individual product information including images, pricing, care indicators (water/sunlight), add-to-cart functionality, wishlist button, and related products section with animations.",
  "frontend/src/pages/Shop.tsx": "Shop page component with filterable product grid supporting category, price range, water level, and sunlight filters, with responsive mobile/desktop filter sidebar and product card display.",
  "frontend/src/types/product.ts": "TypeScript type definitions for Product, CartItem, Category, Testimonial, and CareGuide interfaces used throughout the e-commerce application.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system (sage, beige palettes), extended animations (accordion, float), custom shadows, and responsive container settings.",
  "project_state.json": "Project metadata defining the GreenLeaf plant e-commerce site as a frontend-only implementation with static data, glassmorphism design, animation requirements, and detailed image asset specifications."
}