{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace video hero with static botanical image and text shadow",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Replace video background in hero section with static botanical garden image",
      "acceptanceCriteria": [
        "Video element is removed from hero section",
        "Static image element displays botanical/garden scene with multiple plants",
        "Image covers full hero section width and height",
        "Image uses object-fit: cover for proper scaling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Replace the video element in the hero section with an img element using the generated botanical garden image at frontend/public/assets/generated/hero-botanical-garden.dim_1920x1080.png. Ensure the image uses object-fit: cover and covers the full hero section dimensions while maintaining the existing layout structure and text positioning."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Remove all overlay elements from hero section background",
      "acceptanceCriteria": [
        "No overlay div elements are rendered on top of the background image",
        "Background image is fully visible without any darkening or color filters",
        "No CSS filters or opacity adjustments are applied to the image"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Remove all overlay div elements from the hero section including dark overlays, gradient overlays, and any semi-transparent layers. Ensure no CSS properties like opacity, filter, or background-color are applied that would obscure the botanical image. The image should be fully visible without any darkening effects."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add text shadow effect to hero headline for readability",
      "acceptanceCriteria": [
        "Headline text has visible text-shadow CSS property applied",
        "Text shadow provides sufficient contrast for readability",
        "Text shadow is subtle and does not create harsh visual artifacts",
        "All headline text elements in the hero section have shadow applied"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add text-shadow CSS property to all headline text elements in the hero section to ensure readability against the botanical image background. Use a subtle shadow effect that provides sufficient contrast without creating harsh visual artifacts (e.g., text-shadow: 0 2px 8px rgba(0, 0, 0, 0.6))."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Ensure no solid background container behind headline text",
      "acceptanceCriteria": [
        "Headline text does not have a background-color property",
        "No container div with background color wraps the headline",
        "Text appears directly over the botanical image with only text shadow for visibility"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Verify that no background-color property is applied to headline text elements and no container div with background color wraps the headline. The text should appear directly over the botanical image with only the text shadow providing visibility enhancement."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Remove dynamic color transition animations from hero background",
      "acceptanceCriteria": [
        "No CSS animations or transitions affect the background color",
        "No animated gradient overlays are present",
        "Background remains completely static with no color changes or movements",
        "Hero section uses only the static botanical image without any dynamic effects"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Remove all CSS animations and transitions that affect background colors or create animated gradient overlays in the hero section. The background should remain completely static using only the botanical image with no color changes or movement effects. Preserve other hero section animations like text fade-in and floating elements that do not relate to background color transitions."
        }
      ]
    }
  ]
}