{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Apply sage green backgrounds to all pages except home page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Apply sage green background color to the Shop page while maintaining all existing functionality, filters, and product grid layout",
      "acceptanceCriteria": [
        "Shop page displays sage green background color",
        "All filters, search, and product grid remain fully functional",
        "Text and UI elements remain readable against sage green background"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Shop.tsx",
          "operation": "modify",
          "description": "Add sage green background color using existing Tailwind bg-sage-50 or bg-sage-100 class to the main container div. Ensure the background color spans the full page height and width. Verify that filter controls, product grid, and all interactive elements maintain proper contrast and readability against the sage green background."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply sage green background color to the Product Detail page while preserving all product information display, add-to-cart functionality, and related products section",
      "acceptanceCriteria": [
        "Product detail page displays sage green background color",
        "All product images, descriptions, and interactive elements remain functional",
        "Related products section maintains proper styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductDetail.tsx",
          "operation": "modify",
          "description": "Add sage green background color using existing Tailwind bg-sage-50 or bg-sage-100 class to the main container div. Ensure the background spans the full page area including the product images, details section, care indicators, and related products. Maintain proper contrast for all text and interactive elements including the add-to-cart button and wishlist button."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply sage green background color to the Care Guide page while maintaining the article card layout, reading progress bar, and scroll animations",
      "acceptanceCriteria": [
        "Care guide page displays sage green background color",
        "Article cards, categories, and reading times remain clearly visible",
        "Scroll animations and progress bar continue to function properly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CareGuide.tsx",
          "operation": "modify",
          "description": "Add sage green background color using existing Tailwind bg-sage-50 or bg-sage-100 class to the main container div. Ensure the background encompasses the reading progress bar, article cards grid, and all content sections. Verify that the progress bar visibility, article card styling, and scroll animations remain functional and visually clear against the sage green background."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply sage green background color to the Checkout page while preserving the multi-step form, order summary, and cart validation",
      "acceptanceCriteria": [
        "Checkout page displays sage green background color",
        "All form fields, step indicators, and order summary remain readable and functional",
        "Cart validation and checkout flow work without issues"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Checkout.tsx",
          "operation": "modify",
          "description": "Add sage green background color using existing Tailwind bg-sage-50 or bg-sage-100 class to the main container div. Ensure the background covers the entire checkout area including the step indicator, form sections, and order summary. Maintain proper contrast for form fields, labels, step progress indicators, and the order summary panel to ensure readability and usability."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Keep the Home page completely unchanged, preserving the existing video background and all current styling and elements",
      "acceptanceCriteria": [
        "Home page retains video background without any color changes",
        "All hero section elements, featured products, categories, and testimonials remain as currently implemented",
        "No visual or functional changes applied to home page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "No changes required - verify that no sage green background has been inadvertently applied to the home page. Ensure the video background, hero section, and all existing styling remain completely unchanged."
        }
      ]
    }
  ]
}